tap "homebrew/services"
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap "homebrew/core"

brew "zsh"
brew "zinit"
brew "peco"
brew "coreutils"
brew "awscli"
brew "git"
brew "git-lfs"
brew "imagemagick"
brew "jq"
brew "mitmproxy"
brew "nkf"
brew "rbenv"
brew "rbenv-communal-gems"
brew "ruby-build"
brew "redis"
brew "tree"
brew "vim"
brew 'mysql'
brew 'mitmproxy'
brew "yarn"
brew "starship"
brew "python"

cask "docker"
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "suspicious-package"
cask "apparency"
cask "quicklookase"
cask "qlvideo"
cask "provisionql"
