tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "awscli"
brew "carthage"
brew "coreutils"
brew "git"
brew "git-lfs"
brew "shared-mime-info"
brew "imagemagick"
brew "jq"
brew "mas"
brew "mitmproxy"
brew "mysql"
brew "mysql@5.7"
brew "nkf"
brew "peco"
brew "ruby-build"
brew "rbenv"
brew "rbenv-communal-gems"
brew "redis"
brew "starship"
brew "stow"
brew "tree"
brew "v8@3.15"
brew "vim"
brew "yarn"
brew "zinit"
brew "zsh"

cask "alfred"
cask "apparency", args: { appdir: "/Applications" }
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "postman"
cask "provisionql", args: { appdir: "/Applications" }
cask "qlcolorcode", args: { appdir: "/Applications" }
cask "qlimagesize", args: { appdir: "/Applications" }
cask "qlmarkdown", args: { appdir: "/Applications" }
cask "qlstephen", args: { appdir: "/Applications" }
cask "qlvideo", args: { appdir: "/Applications" }
cask "quicklook-json", args: { appdir: "/Applications" }
cask "quicklookase", args: { appdir: "/Applications" }
cask "suspicious-package", args: { appdir: "/Applications" }

mas "1Password 7", id: 1333542190
mas "Quiver", id: 866773894
mas "Sequel Ace", id: 1518036000
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
