tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "rbenv/tap"
# Library for manipulating PNG images
brew "libpng"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Official Amazon AWS command-line interface
brew "awscli"
# Decentralized dependency manager for Cocoa
brew "carthage"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Isolated development environments using Docker
brew "docker-compose"
# Text processing system for reStructuredText
brew "docutils"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# EXIF and IPTC metadata manipulation library and tools
brew "exiv2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# High performance message passing library
brew "open-mpi"
# Library for encoding and decoding .avif files
brew "libavif"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# File format designed to store large amounts of data
brew "hdf5"
# Tools for manipulating HTML and XML files
brew "html-xml-utils"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Conversion library
brew "libiconv", link: true
# C library for reading and writing MATLAB MAT files
brew "libmatio"
# GNOME XML library
brew "libxml2", link: true
# C XSLT library for GNOME
brew "libxslt", link: true
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Open source relational database management system
brew "mysql-client@8.0"
# Open source relational database management system
brew "mysql@8.0"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk@17"
# Open source suite of directory software
brew "openldap"
# Simplistic interactive filtering tool
brew "peco"
# Highly capable, feature-rich programming language
brew "perl"
# Optimizer for PNG files
brew "pngcrush"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Convert bitmaps to vector graphics
brew "potrace"
# Protocol buffers (Google's data interchange format)
brew "protobuf@21"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Display and control your Android device
brew "scrcpy"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Image processing library
brew "vips"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Flexible and fast Zsh plugin manager
brew "zinit"
# UNIX shell (command interpreter)
brew "zsh"
# SSL/TLS cryptography library
brew "rbenv/tap/openssl@1.0"
# Application launcher and productivity software
cask "alfred"
# Android SDK component
cask "android-platform-tools"
# Inspect application bundles
cask "apparency", args: { appdir: "/Applications" }
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "google-chrome", args: { appdir: "/Applications" }
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Japanese input software
cask "google-japanese-ime"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Collaboration platform for API development
cask "postman"
# Quick Look plugin for mobile apps and provisioning profiles
cask "provisionql", args: { appdir: "/Applications" }
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode", args: { appdir: "/Applications" }
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize", args: { appdir: "/Applications" }
# Quick Look generator for Markdown files
cask "qlmarkdown", args: { appdir: "/Applications" }
# Quick Look plugin for plaintext files without an extension
cask "qlstephen", args: { appdir: "/Applications" }
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo", args: { appdir: "/Applications" }
# Quick Look plugin for JSON files
cask "quicklook-json", args: { appdir: "/Applications" }
# Quick Look generator for Adobe Swatch Exchange files
cask "quicklookase", args: { appdir: "/Applications" }
# Application for inspecting installer packages
cask "suspicious-package", args: { appdir: "/Applications" }
# Quicklook extension for source files
cask "syntax-highlight"
mas "1Password 7", id: 1333542190
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Quiver", id: 866773894
mas "Sequel Ace", id: 1518036000
mas "Xcode", id: 497799835
